hotels.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: load_test_hotels.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m10s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m01.0s/1m40.0s

running (0m02.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m02.0s/1m40.0s

running (0m03.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m03.0s/1m40.0s

running (0m04.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  0m04.0s/1m40.0s

running (0m05.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 02/10 VUs  0m05.0s/1m40.0s

running (0m06.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 02/10 VUs  0m06.0s/1m40.0s

running (0m07.0s), 03/10 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 03/10 VUs  0m07.0s/1m40.0s

running (0m08.0s), 03/10 VUs, 2 complete and 0 interrupted iterations
default   [   8% ] 03/10 VUs  0m08.0s/1m40.0s

running (0m09.0s), 03/10 VUs, 2 complete and 0 interrupted iterations
default   [   9% ] 03/10 VUs  0m09.0s/1m40.0s

running (0m10.0s), 03/10 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 03/10 VUs  0m10.0s/1m40.0s

running (0m11.0s), 04/10 VUs, 2 complete and 0 interrupted iterations
default   [  11% ] 04/10 VUs  0m11.0s/1m40.0s

running (0m12.0s), 04/10 VUs, 3 complete and 0 interrupted iterations
default   [  12% ] 04/10 VUs  0m12.0s/1m40.0s

running (0m13.0s), 04/10 VUs, 5 complete and 0 interrupted iterations
default   [  13% ] 04/10 VUs  0m13.0s/1m40.0s

running (0m14.0s), 05/10 VUs, 5 complete and 0 interrupted iterations
default   [  14% ] 05/10 VUs  0m14.0s/1m40.0s

running (0m15.0s), 05/10 VUs, 7 complete and 0 interrupted iterations
default   [  15% ] 05/10 VUs  0m15.0s/1m40.0s

running (0m16.0s), 05/10 VUs, 10 complete and 0 interrupted iterations
default   [  16% ] 05/10 VUs  0m16.0s/1m40.0s

running (0m17.0s), 06/10 VUs, 12 complete and 0 interrupted iterations
default   [  17% ] 06/10 VUs  0m17.0s/1m40.0s

running (0m18.0s), 06/10 VUs, 14 complete and 0 interrupted iterations
default   [  18% ] 06/10 VUs  0m18.0s/1m40.0s

running (0m19.0s), 06/10 VUs, 16 complete and 0 interrupted iterations
default   [  19% ] 06/10 VUs  0m19.0s/1m40.0s

running (0m20.0s), 06/10 VUs, 19 complete and 0 interrupted iterations
default   [  20% ] 06/10 VUs  0m20.0s/1m40.0s

running (0m21.0s), 07/10 VUs, 21 complete and 0 interrupted iterations
default   [  21% ] 07/10 VUs  0m21.0s/1m40.0s

running (0m22.0s), 07/10 VUs, 26 complete and 0 interrupted iterations
default   [  22% ] 07/10 VUs  0m22.0s/1m40.0s

running (0m23.0s), 07/10 VUs, 28 complete and 0 interrupted iterations
default   [  23% ] 07/10 VUs  0m23.0s/1m40.0s

running (0m24.0s), 08/10 VUs, 32 complete and 0 interrupted iterations
default   [  24% ] 08/10 VUs  0m24.0s/1m40.0s

running (0m25.0s), 08/10 VUs, 39 complete and 0 interrupted iterations
default   [  25% ] 08/10 VUs  0m25.0s/1m40.0s

running (0m26.0s), 08/10 VUs, 46 complete and 0 interrupted iterations
default   [  26% ] 08/10 VUs  0m26.0s/1m40.0s

running (0m27.0s), 09/10 VUs, 49 complete and 0 interrupted iterations
default   [  27% ] 09/10 VUs  0m27.0s/1m40.0s

running (0m28.0s), 09/10 VUs, 55 complete and 0 interrupted iterations
default   [  28% ] 09/10 VUs  0m28.0s/1m40.0s

running (0m29.0s), 09/10 VUs, 62 complete and 0 interrupted iterations
default   [  29% ] 09/10 VUs  0m29.0s/1m40.0s

running (0m30.0s), 09/10 VUs, 69 complete and 0 interrupted iterations
default   [  30% ] 09/10 VUs  0m30.0s/1m40.0s

running (0m31.0s), 10/10 VUs, 75 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  0m31.0s/1m40.0s

running (0m32.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  0m32.0s/1m40.0s

running (0m33.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  0m33.0s/1m40.0s

running (0m34.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  0m34.0s/1m40.0s

running (0m35.0s), 10/10 VUs, 105 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  0m35.0s/1m40.0s

running (0m36.0s), 10/10 VUs, 114 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  0m36.0s/1m40.0s

running (0m37.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  0m37.0s/1m40.0s

running (0m38.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  0m38.0s/1m40.0s

running (0m39.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  0m39.0s/1m40.0s

running (0m40.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  0m40.0s/1m40.0s

running (0m41.0s), 10/10 VUs, 151 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  0m41.0s/1m40.0s

running (0m42.0s), 10/10 VUs, 159 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  0m42.0s/1m40.0s

running (0m43.0s), 10/10 VUs, 166 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  0m43.0s/1m40.0s

running (0m44.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  0m44.0s/1m40.0s

running (0m45.0s), 10/10 VUs, 181 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  0m45.0s/1m40.0s

running (0m46.0s), 10/10 VUs, 189 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  0m46.0s/1m40.0s

running (0m47.0s), 10/10 VUs, 196 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  0m47.0s/1m40.0s

running (0m48.0s), 10/10 VUs, 203 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  0m48.0s/1m40.0s

running (0m49.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  0m49.0s/1m40.0s

running (0m50.0s), 10/10 VUs, 219 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  0m50.0s/1m40.0s

running (0m51.0s), 10/10 VUs, 227 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  0m51.0s/1m40.0s

running (0m52.0s), 10/10 VUs, 232 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  0m52.0s/1m40.0s

running (0m53.0s), 10/10 VUs, 241 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  0m53.0s/1m40.0s

running (0m54.0s), 10/10 VUs, 247 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  0m54.0s/1m40.0s

running (0m55.0s), 10/10 VUs, 254 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  0m55.0s/1m40.0s

running (0m56.0s), 10/10 VUs, 262 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  0m56.0s/1m40.0s

running (0m57.0s), 10/10 VUs, 269 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  0m57.0s/1m40.0s

running (0m58.0s), 10/10 VUs, 276 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  0m58.0s/1m40.0s

running (0m59.0s), 10/10 VUs, 283 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  0m59.0s/1m40.0s

running (1m00.0s), 10/10 VUs, 292 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  1m00.0s/1m40.0s

running (1m01.0s), 10/10 VUs, 298 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  1m01.0s/1m40.0s

running (1m02.0s), 10/10 VUs, 306 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  1m02.0s/1m40.0s

running (1m03.0s), 10/10 VUs, 313 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  1m03.0s/1m40.0s

running (1m04.0s), 10/10 VUs, 316 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  1m04.0s/1m40.0s

running (1m05.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  1m05.0s/1m40.0s

running (1m06.0s), 10/10 VUs, 326 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  1m06.0s/1m40.0s

running (1m07.0s), 10/10 VUs, 332 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  1m07.0s/1m40.0s

running (1m08.0s), 10/10 VUs, 338 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  1m08.0s/1m40.0s

running (1m09.0s), 10/10 VUs, 342 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  1m09.0s/1m40.0s

running (1m10.0s), 10/10 VUs, 347 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  1m10.0s/1m40.0s

running (1m11.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  1m11.0s/1m40.0s

running (1m12.0s), 10/10 VUs, 355 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  1m12.0s/1m40.0s

running (1m13.0s), 10/10 VUs, 361 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  1m13.0s/1m40.0s

running (1m14.0s), 10/10 VUs, 368 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  1m14.0s/1m40.0s

running (1m15.0s), 10/10 VUs, 375 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  1m15.0s/1m40.0s

running (1m16.0s), 10/10 VUs, 384 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  1m16.0s/1m40.0s

running (1m17.0s), 10/10 VUs, 390 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  1m17.0s/1m40.0s

running (1m18.0s), 10/10 VUs, 397 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  1m18.0s/1m40.0s

running (1m19.0s), 10/10 VUs, 404 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  1m19.0s/1m40.0s

running (1m20.0s), 10/10 VUs, 414 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  1m20.0s/1m40.0s

running (1m21.0s), 10/10 VUs, 419 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  1m21.0s/1m40.0s

running (1m22.0s), 10/10 VUs, 425 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  1m22.0s/1m40.0s

running (1m23.0s), 10/10 VUs, 434 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  1m23.0s/1m40.0s

running (1m24.0s), 10/10 VUs, 441 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  1m24.0s/1m40.0s

running (1m25.0s), 10/10 VUs, 448 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  1m25.0s/1m40.0s

running (1m26.0s), 10/10 VUs, 455 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  1m26.0s/1m40.0s

running (1m27.0s), 10/10 VUs, 463 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  1m27.0s/1m40.0s

running (1m28.0s), 10/10 VUs, 470 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  1m28.0s/1m40.0s

running (1m29.0s), 10/10 VUs, 477 complete and 0 interrupted iterations
default   [  89% ] 10/10 VUs  1m29.0s/1m40.0s

running (1m30.0s), 10/10 VUs, 485 complete and 0 interrupted iterations
default   [  90% ] 10/10 VUs  1m30.0s/1m40.0s

running (1m31.0s), 10/10 VUs, 492 complete and 0 interrupted iterations
default   [  91% ] 10/10 VUs  1m31.0s/1m40.0s

running (1m32.0s), 10/10 VUs, 500 complete and 0 interrupted iterations
default   [  92% ] 10/10 VUs  1m32.0s/1m40.0s

running (1m33.0s), 09/10 VUs, 507 complete and 0 interrupted iterations
default   [  93% ] 09/10 VUs  1m33.0s/1m40.0s

running (1m34.0s), 08/10 VUs, 513 complete and 0 interrupted iterations
default   [  94% ] 08/10 VUs  1m34.0s/1m40.0s

running (1m35.0s), 06/10 VUs, 520 complete and 0 interrupted iterations
default   [  95% ] 06/10 VUs  1m35.0s/1m40.0s

running (1m36.0s), 06/10 VUs, 525 complete and 0 interrupted iterations
default   [  96% ] 06/10 VUs  1m36.0s/1m40.0s

running (1m37.0s), 04/10 VUs, 529 complete and 0 interrupted iterations
default   [  97% ] 04/10 VUs  1m37.0s/1m40.0s

running (1m38.0s), 04/10 VUs, 531 complete and 0 interrupted iterations
default   [  98% ] 04/10 VUs  1m38.0s/1m40.0s

running (1m39.0s), 02/10 VUs, 535 complete and 0 interrupted iterations
default   [  99% ] 02/10 VUs  1m39.0s/1m40.0s

running (1m40.0s), 02/10 VUs, 535 complete and 0 interrupted iterations
default   [ 100% ] 02/10 VUs  1m40.0s/1m40.0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 537      ✗ 0   
     data_received..................: 15 MB   146 kB/s
     data_sent......................: 146 kB  1.5 kB/s
     http_req_blocked...............: avg=1.64ms   min=276ns    med=584ns    max=153.63ms p(90)=990ns    p(95)=1.23µs  
     http_req_connecting............: avg=706.16µs min=0s       med=0s       max=38.54ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=506.94ms min=248.97ms med=325.84ms max=7.08s    p(90)=623.99ms p(95)=746.57ms
       { expected_response:true }...: avg=506.94ms min=248.97ms med=325.84ms max=7.08s    p(90)=623.99ms p(95)=746.57ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 537 
     http_req_receiving.............: avg=31.56ms  min=43.76µs  med=38.23ms  max=78.09ms  p(90)=39.41ms  p(95)=41.34ms 
     http_req_sending...............: avg=121.32µs min=43.58µs  med=98.71µs  max=3.29ms   p(90)=183.2µs  p(95)=211.52µs
     http_req_tls_handshaking.......: avg=796.25µs min=0s       med=0s       max=45.27ms  p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=475.25ms min=210.09ms med=303.23ms max=7.04s    p(90)=584.35ms p(95)=707.55ms
     http_reqs......................: 537     5.359438/s
     iteration_duration.............: avg=1.51s    min=1.25s    med=1.34s    max=8.08s    p(90)=1.62s    p(95)=1.76s   
     iterations.....................: 537     5.359438/s
     vus............................: 2       min=1      max=10
     vus_max........................: 10      min=10     max=10


running (1m40.2s), 00/10 VUs, 537 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m40s

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: load_test_hotels.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m10s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m01.0s/1m40.0s

running (0m02.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m02.0s/1m40.0s

running (0m03.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m03.0s/1m40.0s

running (0m04.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  0m04.0s/1m40.0s

running (0m05.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 02/10 VUs  0m05.0s/1m40.0s

running (0m06.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 02/10 VUs  0m06.0s/1m40.0s

running (0m07.0s), 03/10 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 03/10 VUs  0m07.0s/1m40.0s

running (0m08.0s), 03/10 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 03/10 VUs  0m08.0s/1m40.0s

running (0m09.0s), 03/10 VUs, 2 complete and 0 interrupted iterations
default   [   9% ] 03/10 VUs  0m09.0s/1m40.0s

running (0m10.0s), 03/10 VUs, 3 complete and 0 interrupted iterations
default   [  10% ] 03/10 VUs  0m10.0s/1m40.0s

running (0m11.0s), 04/10 VUs, 3 complete and 0 interrupted iterations
default   [  11% ] 04/10 VUs  0m11.0s/1m40.0s

running (0m12.0s), 04/10 VUs, 3 complete and 0 interrupted iterations
default   [  12% ] 04/10 VUs  0m12.0s/1m40.0s

running (0m13.0s), 04/10 VUs, 3 complete and 0 interrupted iterations
default   [  13% ] 04/10 VUs  0m13.0s/1m40.0s

running (0m14.0s), 05/10 VUs, 4 complete and 0 interrupted iterations
default   [  14% ] 05/10 VUs  0m14.0s/1m40.0s

running (0m15.0s), 05/10 VUs, 6 complete and 0 interrupted iterations
default   [  15% ] 05/10 VUs  0m15.0s/1m40.0s

running (0m16.0s), 05/10 VUs, 8 complete and 0 interrupted iterations
default   [  16% ] 05/10 VUs  0m16.0s/1m40.0s

running (0m17.0s), 06/10 VUs, 10 complete and 0 interrupted iterations
default   [  17% ] 06/10 VUs  0m17.0s/1m40.0s

running (0m18.0s), 06/10 VUs, 15 complete and 0 interrupted iterations
default   [  18% ] 06/10 VUs  0m18.0s/1m40.0s

running (0m19.0s), 06/10 VUs, 18 complete and 0 interrupted iterations
default   [  19% ] 06/10 VUs  0m19.0s/1m40.0s

running (0m20.0s), 06/10 VUs, 21 complete and 0 interrupted iterations
default   [  20% ] 06/10 VUs  0m20.0s/1m40.0s

running (0m21.0s), 07/10 VUs, 26 complete and 0 interrupted iterations
default   [  21% ] 07/10 VUs  0m21.0s/1m40.0s

running (0m22.0s), 07/10 VUs, 29 complete and 0 interrupted iterations
default   [  22% ] 07/10 VUs  0m22.0s/1m40.0s

running (0m23.0s), 07/10 VUs, 34 complete and 0 interrupted iterations
default   [  23% ] 07/10 VUs  0m23.0s/1m40.0s

running (0m24.0s), 08/10 VUs, 40 complete and 0 interrupted iterations
default   [  24% ] 08/10 VUs  0m24.0s/1m40.0s

running (0m25.0s), 08/10 VUs, 45 complete and 0 interrupted iterations
default   [  25% ] 08/10 VUs  0m25.0s/1m40.0s

running (0m26.0s), 08/10 VUs, 52 complete and 0 interrupted iterations
default   [  26% ] 08/10 VUs  0m26.0s/1m40.0s

running (0m27.0s), 09/10 VUs, 56 complete and 0 interrupted iterations
default   [  27% ] 09/10 VUs  0m27.0s/1m40.0s

running (0m28.0s), 09/10 VUs, 62 complete and 0 interrupted iterations
default   [  28% ] 09/10 VUs  0m28.0s/1m40.0s

running (0m29.0s), 09/10 VUs, 70 complete and 0 interrupted iterations
default   [  29% ] 09/10 VUs  0m29.0s/1m40.0s

running (0m30.0s), 09/10 VUs, 76 complete and 0 interrupted iterations
default   [  30% ] 09/10 VUs  0m30.0s/1m40.0s

running (0m31.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  0m31.0s/1m40.0s

running (0m32.0s), 10/10 VUs, 92 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  0m32.0s/1m40.0s

running (0m33.0s), 10/10 VUs, 98 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  0m33.0s/1m40.0s

running (0m34.0s), 10/10 VUs, 105 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  0m34.0s/1m40.0s

running (0m35.0s), 10/10 VUs, 113 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  0m35.0s/1m40.0s

running (0m36.0s), 10/10 VUs, 121 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  0m36.0s/1m40.0s

running (0m37.0s), 10/10 VUs, 123 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  0m37.0s/1m40.0s

running (0m38.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  0m38.0s/1m40.0s

running (0m39.0s), 10/10 VUs, 134 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  0m39.0s/1m40.0s

running (0m40.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  0m40.0s/1m40.0s

running (0m41.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  0m41.0s/1m40.0s

running (0m42.0s), 10/10 VUs, 147 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  0m42.0s/1m40.0s

running (0m43.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  0m43.0s/1m40.0s

running (0m44.0s), 10/10 VUs, 152 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  0m44.0s/1m40.0s

running (0m45.0s), 10/10 VUs, 158 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  0m45.0s/1m40.0s

running (0m46.0s), 10/10 VUs, 163 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  0m46.0s/1m40.0s

running (0m47.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  0m47.0s/1m40.0s

running (0m48.0s), 10/10 VUs, 179 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  0m48.0s/1m40.0s

running (0m49.0s), 10/10 VUs, 187 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  0m49.0s/1m40.0s

running (0m50.0s), 10/10 VUs, 194 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  0m50.0s/1m40.0s

running (0m51.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  0m51.0s/1m40.0s

running (0m52.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  0m52.0s/1m40.0s

running (0m53.0s), 10/10 VUs, 216 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  0m53.0s/1m40.0s

running (0m54.0s), 10/10 VUs, 224 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  0m54.0s/1m40.0s

running (0m55.0s), 10/10 VUs, 229 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  0m55.0s/1m40.0s

running (0m56.0s), 10/10 VUs, 237 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  0m56.0s/1m40.0s

running (0m57.0s), 10/10 VUs, 245 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  0m57.0s/1m40.0s

running (0m58.0s), 10/10 VUs, 251 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  0m58.0s/1m40.0s

running (0m59.0s), 10/10 VUs, 259 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  0m59.0s/1m40.0s

running (1m00.0s), 10/10 VUs, 266 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  1m00.0s/1m40.0s

running (1m01.0s), 10/10 VUs, 273 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  1m01.0s/1m40.0s

running (1m02.0s), 10/10 VUs, 281 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  1m02.0s/1m40.0s

running (1m03.0s), 10/10 VUs, 288 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  1m03.0s/1m40.0s

running (1m04.0s), 10/10 VUs, 295 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  1m04.0s/1m40.0s

running (1m05.0s), 10/10 VUs, 303 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  1m05.0s/1m40.0s

running (1m06.0s), 10/10 VUs, 312 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  1m06.0s/1m40.0s

running (1m07.0s), 10/10 VUs, 318 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  1m07.0s/1m40.0s

running (1m08.0s), 10/10 VUs, 325 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  1m08.0s/1m40.0s

running (1m09.0s), 10/10 VUs, 333 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  1m09.0s/1m40.0s

running (1m10.0s), 10/10 VUs, 341 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  1m10.0s/1m40.0s

running (1m11.0s), 10/10 VUs, 347 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  1m11.0s/1m40.0s

running (1m12.0s), 10/10 VUs, 354 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  1m12.0s/1m40.0s

running (1m13.0s), 10/10 VUs, 362 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  1m13.0s/1m40.0s

running (1m14.0s), 10/10 VUs, 369 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  1m14.0s/1m40.0s

running (1m15.0s), 10/10 VUs, 376 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  1m15.0s/1m40.0s

running (1m16.0s), 10/10 VUs, 383 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  1m16.0s/1m40.0s

running (1m17.0s), 10/10 VUs, 391 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  1m17.0s/1m40.0s

running (1m18.0s), 10/10 VUs, 397 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  1m18.0s/1m40.0s

running (1m19.0s), 10/10 VUs, 406 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  1m19.0s/1m40.0s

running (1m20.0s), 10/10 VUs, 413 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  1m20.0s/1m40.0s

running (1m21.0s), 10/10 VUs, 419 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  1m21.0s/1m40.0s

running (1m22.0s), 10/10 VUs, 427 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  1m22.0s/1m40.0s

running (1m23.0s), 10/10 VUs, 434 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  1m23.0s/1m40.0s

running (1m24.0s), 10/10 VUs, 441 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  1m24.0s/1m40.0s

running (1m25.0s), 10/10 VUs, 449 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  1m25.0s/1m40.0s

running (1m26.0s), 10/10 VUs, 456 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  1m26.0s/1m40.0s

running (1m27.0s), 10/10 VUs, 462 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  1m27.0s/1m40.0s

running (1m28.0s), 10/10 VUs, 471 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  1m28.0s/1m40.0s

running (1m29.0s), 10/10 VUs, 476 complete and 0 interrupted iterations
default   [  89% ] 10/10 VUs  1m29.0s/1m40.0s

running (1m30.0s), 10/10 VUs, 484 complete and 0 interrupted iterations
default   [  90% ] 10/10 VUs  1m30.0s/1m40.0s

running (1m31.0s), 10/10 VUs, 491 complete and 0 interrupted iterations
default   [  91% ] 10/10 VUs  1m31.0s/1m40.0s

running (1m32.0s), 09/10 VUs, 498 complete and 0 interrupted iterations
default   [  92% ] 09/10 VUs  1m32.0s/1m40.0s

running (1m33.0s), 09/10 VUs, 506 complete and 0 interrupted iterations
default   [  93% ] 09/10 VUs  1m33.0s/1m40.0s

running (1m34.0s), 08/10 VUs, 511 complete and 0 interrupted iterations
default   [  94% ] 08/10 VUs  1m34.0s/1m40.0s

running (1m35.0s), 07/10 VUs, 518 complete and 0 interrupted iterations
default   [  95% ] 07/10 VUs  1m35.0s/1m40.0s

running (1m36.0s), 06/10 VUs, 521 complete and 0 interrupted iterations
default   [  96% ] 06/10 VUs  1m36.0s/1m40.0s

running (1m37.0s), 04/10 VUs, 526 complete and 0 interrupted iterations
default   [  97% ] 04/10 VUs  1m37.0s/1m40.0s

running (1m38.0s), 04/10 VUs, 529 complete and 0 interrupted iterations
default   [  98% ] 04/10 VUs  1m38.0s/1m40.0s

running (1m39.0s), 03/10 VUs, 532 complete and 0 interrupted iterations
default   [  99% ] 03/10 VUs  1m39.0s/1m40.0s

running (1m40.0s), 02/10 VUs, 533 complete and 0 interrupted iterations
default   [ 100% ] 02/10 VUs  1m40.0s/1m40.0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 535      ✗ 0   
     data_received..................: 18 MB   175 kB/s
     data_sent......................: 153 kB  1.5 kB/s
     http_req_blocked...............: avg=1.63ms   min=275ns    med=591ns    max=153.12ms p(90)=1.02µs   p(95)=1.39µs  
     http_req_connecting............: avg=711.02µs min=0s       med=0s       max=39.76ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=518.35ms min=254ms    med=355.18ms max=6.72s    p(90)=604.5ms  p(95)=759.72ms
       { expected_response:true }...: avg=518.35ms min=254ms    med=355.18ms max=6.72s    p(90)=604.5ms  p(95)=759.72ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 535 
     http_req_receiving.............: avg=38.03ms  min=53.86µs  med=38.56ms  max=81.31ms  p(90)=41.41ms  p(95)=75.98ms 
     http_req_sending...............: avg=117.49µs min=53.81µs  med=96.83µs  max=1.26ms   p(90)=173.5µs  p(95)=230.81µs
     http_req_tls_handshaking.......: avg=796.8µs  min=0s       med=0s       max=51.45ms  p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=480.19ms min=215.47ms med=315.14ms max=6.68s    p(90)=543.47ms p(95)=720.36ms
     http_reqs......................: 535     5.330089/s
     iteration_duration.............: avg=1.52s    min=1.25s    med=1.35s    max=7.72s    p(90)=1.6s     p(95)=1.76s   
     iterations.....................: 535     5.330089/s
     vus............................: 2       min=1      max=10
     vus_max........................: 10      min=10     max=10


running (1m40.4s), 00/10 VUs, 535 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m40s